{
  "PS12364199": {
    "partNumber": "PS12364199",
    "name": "Refrigerator Door Shelf Bin",
    "price": "$35.15",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/12364199-1-N-Frigidaire-242126602-Refrigerator-Door-Shelf-Bin.jpg",
    "manufacturerPartNumber": "242126602",
    "partType": "unknown",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS12364199-Frigidaire-242126602-Refrigerator-Door-Shelf-Bin.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This manufacturer-certified Refrigerator Door Shelf Bin, also known as a crisper bin or door shelf bin, is made of clear plastic, and is easy to install. It is used to hold items in the fridge, like jars, cans, and condiments and you'll be able to visually see if the part is broken or cracked. This particular shelf attaches to the fridge door. You can check if this model is right for your appliance by checking your user manual and model number. This part should simply snap into place without the need for any tools as part of the repair. Just carefully line up the slots on the door with the slots on the bin and slide the bin down to completely lock it into place. The part is sold individually, and fits many different types of side-by-side refrigerators.",
    "numberOfReviews": 98
  },
  "PS11701542": {
    "partNumber": "PS11701542",
    "name": "Refrigerator Ice and Water Filter",
    "price": "$62.38",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11701542-1-N-Whirlpool-EDR1RXD1-Refrigerator-Ice-and-Water-Filter.jpg",
    "manufacturerPartNumber": "EDR1RXD1",
    "partType": "filter",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11701542-Whirlpool-EDR1RXD1-Refrigerator-Ice-and-Water-Filter.htm?SourceCode=18",
    "starRating": "96%",
    "description": "The EDR1RXD1 water filter provides clean, fresh-tasting water by reducing contaminants such as lead, chlorine, and particulates. Designed for easy installation, this filter ensures your refrigerator water and ice are safe and refreshing with every use",
    "numberOfReviews": 105
  },
  "PS11752778": {
    "partNumber": "PS11752778",
    "name": "Refrigerator Door Shelf Bin",
    "price": "$36.18",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11752778-1-N-Whirlpool-WPW10321304-Refrigerator-Door-Shelf-Bin.jpg",
    "manufacturerPartNumber": "WPW10321304",
    "partType": "unknown",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11752778-Whirlpool-WPW10321304-Refrigerator-Door-Shelf-Bin.htm?SourceCode=18",
    "starRating": "97%",
    "description": "This refrigerator door bin is a genuine OEM replacement designed to fit many side-by-side refrigerator models. Compatible with brands like KitchenAid, Maytag, and Amana, it attaches to the interior door, providing storage for jars and bottles. Featuring a clear design with white trim, this bin is both durable and functional. Installation is tool-free—simply align and snap into place. Verify your refrigerator’s model number before ordering to ensure compatibility, as dimensions may vary slightly. Restore your refrigerator's storage capacity and organization with this high-quality replacement door bin.",
    "numberOfReviews": 308
  },
  "PS734935": {
    "partNumber": "PS734935",
    "name": "Refrigerator Door Shelf Retainer Bar",
    "price": "$37.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/734935-1-N-Frigidaire-240534901-Door-Shelf-Retainer-Bar.jpg",
    "manufacturerPartNumber": "240534901",
    "partType": "unknown",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS734935-Frigidaire-240534901-Door-Shelf-Retainer-Bar.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This door shelf retaining bar, also known as refrigerator door bar retainer or fridge door rack, is a genuine part sourced from the original manufacturer. It is a white This manufacturer-certified Door Shelf Retainer Bar, sometimes otherwise known as the door rack or bar retainer, is a white, plastic part which can be easily installed onto the inside of the refrigerator or freezer door to hold items on the door shelves. It holds items in your fridge and will show physical damage if broken or warped, at which time it should be replaced. Check your user manual and model number to see if this part is right for you. No tools are required for this installation, the part should simply snap into place. This part measures roughly 25 inches wide, 3 inches high, and 5 inches deep. This part is sold individually, and we recommend checking the other door shelf retaining bars on your refrigerator or freezer at the same time as ordering this part to ensure that no others need to be replaced, as they often wear or warp at similar speeds.",
    "numberOfReviews": 171
  },
  "PS11739091": {
    "partNumber": "PS11739091",
    "name": "Refrigerator Door Shelf Bin - White",
    "price": "$31.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11739091-1-N-Whirlpool-WP2187172-Refrigerator-Door-Shelf-Bin-White.jpg",
    "manufacturerPartNumber": "WP2187172",
    "partType": "unknown",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11739091-Whirlpool-WP2187172-Refrigerator-Door-Shelf-Bin-White.htm?SourceCode=18",
    "starRating": "99%",
    "description": "The white refrigerator door bin is an essential component for maximizing the storage capacity of your appliance. Measuring approximately 16.25\" wide, 3.25\" high, and 6.25\" deep, it securely holds jars, bottles, and other items in an accessible location on the refrigerator door. This bin is made from sturdy materials to withstand daily use and is designed to fit seamlessly into compatible refrigerator models. Installation is straightforward—simply follow the instructions provided in your owner’s manual. Confirm compatibility by matching the bin’s dimensions to your appliance before purchasing.",
    "numberOfReviews": 236
  },
  "PS11722130": {
    "partNumber": "PS11722130",
    "name": "Refrigerator Water Filter",
    "price": "$62.38",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11722130-1-N-Whirlpool-EDR4RXD1-Refrigerator-Water-Filter.jpg",
    "manufacturerPartNumber": "EDR4RXD1",
    "partType": "filter",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11722130-Whirlpool-EDR4RXD1-Refrigerator-Water-Filter.htm?SourceCode=18",
    "starRating": "93%",
    "description": "This water filter (Whirlpool EveryDrop Refrigerator Water Filter, Single Turn Filter) purifies water going to the water dispenser and sometimes the icemaker as well. This part should be replaced if it is causing reduced water flow or just replaced periodically per the owner manual. Replacing this water filter may fix a noisy or leaking fridge, a fridge that is not dispensing water (or reduced flow rate), and an ice maker that is not making ice at all, or not making enough ice. This filter is white, sold individually and measures 8 inches by 3 inches in diameter. This water filter has been updated by the manufacturer. It may appear different but will still function the same. It is sold individually.",
    "numberOfReviews": 96
  },
  "PS11739119": {
    "partNumber": "PS11739119",
    "name": "Refrigerator Crisper Drawer with Humidity Control",
    "price": "$72.78",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11739119-1-N-Whirlpool-WP2188656-Refrigerator-Crisper-Drawer-with-Humidity-Control.jpg",
    "manufacturerPartNumber": "WP2188656",
    "partType": "unknown",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11739119-Whirlpool-WP2188656-Refrigerator-Crisper-Drawer-with-Humidity-Control.htm?SourceCode=18",
    "starRating": "97%",
    "description": "The crisper drawer (Crisper Pan, Refrigerator Crisper Drawer) with humidity control is meant to keep your vegetables and fruit as fresh as possible by allowing you to regulate the humidity levels within the drawer. It attaches on the inside of your refrigerator to the bottom of the crisper shelf. This drawer can break from misuse or accidental damage. It is also subject to material fatigue over time. If broken or damaged, it may be difficult to slide the drawer in and out, and it should be replaced. This plastic drawer measures 14.92 inches long, 7.6 inches high, and 16.5 inches wide and comes in white/clear.",
    "numberOfReviews": 407
  },
  "PS11704498": {
    "partNumber": "PS11704498",
    "name": "Refrigerator Water Filter - White",
    "price": "$64.97",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11704498-1-N-Frigidaire-EPTWFU01-Refrigerator-Water-Filter-White.jpg",
    "manufacturerPartNumber": "EPTWFU01",
    "partType": "filter",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11704498-Frigidaire-EPTWFU01-Refrigerator-Water-Filter-White.htm?SourceCode=18",
    "starRating": "97%",
    "description": "This OEM refrigerator filter is for french door and side-by-side door types and is located in the back, top-right of your appliance. By absorbing heavy metals, pharmaceuticals, pesticides, chlorine, and much more, this filter provides delicious and healthy drinking water. This filter measures 2 inches deep, 9 inches high, 2 inches wide, and weighs 0.9 lbs. The installation is quick and easy with a push and twist feature. Don't forget to run water through the dispenser for about three minutes or 1.5 gallons to prepare the filter before use. For best performance replace this filter every six months.",
    "numberOfReviews": 13
  },
  "PS16217433": {
    "partNumber": "PS16217433",
    "name": "Refrigerator Water Filter",
    "price": "$79.91",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/16217433-1-N-GE-XWFE-Refrigerator-Water-Filter.jpg",
    "manufacturerPartNumber": "XWFE",
    "partType": "filter",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS16217433-GE-XWFE-Refrigerator-Water-Filter.htm?SourceCode=18",
    "starRating": "100%",
    "description": "This water filter is found in the rear upper-right corner of the interior of the refrigerator. If your model has a replacement indicator light it will turn red to signal the need for a replacement. If your model does not have an indicator light, the filter cartridge should be replaced every six months or earlier if you notice a decrease in the flow of water from the dispenser. The filter media is carbon black and reduces leads, some pharmaceuticals, and fifty other contaminates. It is 2 inches deep, 6 inches high, 2.25 inches wide and weighs approximately 1 lbs. When it comes time to replace the filter, first discard the old one by turning it to the left to remove. It will release itself when it has been turned far enough. Installation instructions are quick and simple but can vary slightly depending on if it is a bottom-freezer, side-by-side or multi-door bottom-freezer model. Refer to the user instructions for you filter. Do not forget to reset the filter change indicator if applicable. In bottom-freezer and side-by-side models this is done by pressing and holding the RESET WATER FILTER bottom for three seconds. On a multi-door bottom-freezer model, press the button underneath the Confirm Filter Change message while the water is dispensing. On select models this reset is done automatically once a new filter is installed.",
    "numberOfReviews": 16
  },
  "PS10063209": {
    "partNumber": "PS10063209",
    "name": "Refrigerator Water Filter",
    "price": "$92.32",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/10063209-1-N-GE-RPWFE-Refrigerator-Water-Filter.jpg",
    "manufacturerPartNumber": "RPWFE",
    "partType": "filter",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS10063209-GE-RPWFE-Refrigerator-Water-Filter.htm?SourceCode=18",
    "starRating": "91%",
    "description": "This NSF-certified water filter helps to improve the taste, quality, and health of your water by removing a number of contaminants including mercury, lead, and trace pharmaceuticals. The filter should be replaced every six month or after 300 gallons of water have been filtered. If you are unsure if your filter is due for replacement, another indicator is if the water flow from the dispenser has slowed down considerably. Replacing this part is a simple task that does not require any tools or shutting off the water or power supply to your fridge. Once the new filter has been installed, be sure to run at least two gallons of water through before consuming.",
    "numberOfReviews": 35
  },
  "PS12364147": {
    "partNumber": "PS12364147",
    "name": "Refrigerator Ice Maker Assembly",
    "price": "$141.49",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/12364147-3-N-Frigidaire-241798231-Refrigerator-Ice-Maker-Assembly.jpg",
    "manufacturerPartNumber": "241798231",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS12364147-Frigidaire-241798231-Refrigerator-Ice-Maker-Assembly.htm?SourceCode=18",
    "starRating": "98%",
    "description": "This 8-cube ice maker is used to create ice for your refrigerator. The ice maker receives water from the water inlet valve and will freeze until ice cubes are formed. Once the water has been frozen the cubes will be ejected from the mold in to the ice bucket. The ice maker will continue the process until the ice bucket has reached the limit. If your ice maker is not making ice you may need to replace this part. Please remember to disconnect the power and water supply before starting your repair. This ice maker is a genuine OEM part.",
    "numberOfReviews": 85
  },
  "PS11765620": {
    "partNumber": "PS11765620",
    "name": "Refrigerator Ice Maker Assembly",
    "price": "$90.94",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11765620-1-N-Whirlpool-W10884390-Refrigerator-Ice-Maker-Assembly.jpg",
    "manufacturerPartNumber": "W10884390",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11765620-Whirlpool-W10884390-Refrigerator-Ice-Maker-Assembly.htm?SourceCode=18",
    "starRating": "94%",
    "description": "This is an ice maker assembly for various models of refrigerator. This ice maker assembly is used to freeze and eject ice into the ice bucket, then dispense the ice. This ice maker comes with the necessary shut-off arm, as well as a wire harness to properly install it into the freezer compartment of your refrigerator. If your current ice maker is either not producing ice or not breaking the ice up properly, it will need to be replaced. This ice maker assembly is an OEM part and is sold on its own, without any other parts or accessories.",
    "numberOfReviews": 67
  },
  "PS11738120": {
    "partNumber": "PS11738120",
    "name": "Refrigerator Ice Maker",
    "price": "$75.92",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11738120-1-N-Whirlpool-W10873791-Refrigerator-Ice-Maker.jpg",
    "manufacturerPartNumber": "W10873791",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11738120-Whirlpool-W10873791-Refrigerator-Ice-Maker.htm?SourceCode=18",
    "starRating": "89%",
    "description": "This ice maker is for refrigerators. Ice maker includes the ice mold and the control device. The ice maker receives water from the water inlet valve and then holds the water in the ice mold until the water freezes solid. It then automatically ejects the ice and refills to continue the process until the ice storage in is full. Safely store any food that could deteriorate while the power is off and unplug the refrigerator when installing this part. Wear work gloves to protect your hands.",
    "numberOfReviews": 43
  },
  "PS358591": {
    "partNumber": "PS358591",
    "name": "Refrigerator Replacement Ice Maker",
    "price": "$111.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/358591-1-N-Whirlpool-4317943-Replacement-Ice-Maker.jpg",
    "manufacturerPartNumber": "4317943",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS358591-Whirlpool-4317943-Replacement-Ice-Maker.htm?SourceCode=18",
    "starRating": "96%",
    "description": "This ice maker (Complete Icemaker Assembly, Whirlpool Icemaker Kit, Ice Maker Assembly, Refrigerator Ice Maker, Icemaker) receives water from the water inlet valve, freezes it, and dispenses it into the ice bucket until the bucket is full. Ice makers will need to be replaced every 3-10 years depending on the frequency of usage, and water quality. You can perform a voltage test with a multimeter or perform an inlet valve test. If you’re unable to make ice, or notice leaks then it may be a sign your ice maker is damaged and could be in need of a replacement. This model measures approximately 11x5 inches, is constructed of plastic and metal, and comes in black/silver. This ice maker is a complete assembly; the whole assembly attaches to the wall of your freezer. ***NOTE: Ice maker does NOT come with the bail or shut off arm. You must order them separately if required. It does come complete with flat and round plug wiring harness, the mounting hardware, and the instructions. The harness can be reused. The ice maker will not fit refrigerators that have the ice auger mounted on the door.",
    "numberOfReviews": 224
  },
  "PS2121513": {
    "partNumber": "PS2121513",
    "name": "Refrigerator Replacement Ice Maker",
    "price": "$89.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/2121513-1-N-Whirlpool-D7824706Q-Replacement-Ice-Maker.jpg",
    "manufacturerPartNumber": "D7824706Q",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS2121513-Whirlpool-D7824706Q-Replacement-Ice-Maker.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This ice maker (Ice Maker Assembly, Refrigerator Ice Maker) produces ice cubes that are ejected into the storage bucket. It is located in the freezer section of your appliance, mounted on the freezer wall. The ice maker can break from normal wear and accidental damage. If this happens, your refrigerator may no longer make ice cubes, or may not make enough cubes, and the part should be replaced. This model measures approximately 11 inches long and 5 inches wide. It’s constructed of plastic and metal, and comes in black/white/silver. This assembly includes the ice mold and the control device.",
    "numberOfReviews": 154
  },
  "PS16221322": {
    "partNumber": "PS16221322",
    "name": "Refrigerator Ice Maker Assembly",
    "price": "$99.21",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/16221322-1-N-Frigidaire-243297613-Ice-Maker-Assembly.jpg",
    "manufacturerPartNumber": "243297613",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS16221322-Frigidaire-243297613-Ice-Maker-Assembly.htm?SourceCode=18",
    "starRating": "91%",
    "description": "This is a genuine Frigidaire part for your refrigerator. This is an ice maker, which connects to the water lines to provide fresh ice. The most common reason to replace this part is if your refrigerator is leaking, or it will not produce ice cubes. Be sure to disconnect the power to your refrigerator before beginning this repair.",
    "numberOfReviews": 31
  },
  "PS1993870": {
    "partNumber": "PS1993870",
    "name": "Refrigerator Ice Maker",
    "price": "$191.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/1993870-1-N-GE-WR30X10093-Ice-Maker.jpg",
    "manufacturerPartNumber": "WR30X10093",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS1993870-GE-WR30X10093-Ice-Maker.htm?SourceCode=18",
    "starRating": "93%",
    "description": "This 10 by 5 inch ice maker (Electromechanical Icemaker Kit, Ice Maker Assembly) produces ice. This particular model will produce seven crescent shaped cubes every cycle. It is constructed of plastic and metal, and comes in black/white. This kit includes a set of installation instructions, a 4-pin round plug-in connector, 6 post plug-in connectors, tube and fill cup. The ideal temperature of a freezer is zero degrees Fahrenheit. If the temperature in your freezer is at an appropriate level yet ice is still not being made, it could be an issue with the water inlet valve or your ice maker assembly. If you determine it is the ice maker, this is the replacement you need. The ice maker can break from normal wear and accidental damage. Ice makers will need to be replaced every 3-10 years depending on the frequency of usage and water quality. This model is mounted on the freezer wall.",
    "numberOfReviews": 78
  },
  "PS869316": {
    "partNumber": "PS869316",
    "name": "Refrigerator Ice Maker Assembly - 8 Cube",
    "price": "$115.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/869316-1-N-Whirlpool-2198597-Ice-Maker-Assembly-8-Cube.jpg",
    "manufacturerPartNumber": "2198597",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS869316-Whirlpool-2198597-Ice-Maker-Assembly-8-Cube.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This Ice Maker (Icemaker Assembly, Complete Icemaker Assembly, Ice Maker Assembly, Refrigerator Ice Maker) can be used with 25-27 cubic feet refrigerators that have a vertical auger dispenser located on the freezer door. It’s used to make ice. When this part fails, no ice cubes will be made. It could prevent the icemaker from filling with water or just prevent the harvesting of the ice cubes. This is a sign the part should be replaced. The parts electrical contacts and motor can fail due to normal wear and tear. The icemaker attaches to the ceiling of the freezer compartment. This assembly measures 11 inches by 5 inches, is constructed of plastic and metal, and comes in black/white.",
    "numberOfReviews": 99
  },
  "PS11757044": {
    "partNumber": "PS11757044",
    "name": "Refrigerator Ice Bucket",
    "price": "$82.07",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11757044-1-N-Whirlpool-WPW10670845-Ice-Bucket.jpg",
    "manufacturerPartNumber": "WPW10670845",
    "partType": "unknown",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11757044-Whirlpool-WPW10670845-Ice-Bucket.htm?SourceCode=18",
    "starRating": "98%",
    "description": "Bucket only. All other parts sold separately. This part holds the ice once it's released from the icemaker.",
    "numberOfReviews": 56
  },
  "PS11752389": {
    "partNumber": "PS11752389",
    "name": "Refrigerator Ice Maker Replacement",
    "price": "$156.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11752389-1-N-Whirlpool-WPW10300022-Refrigerator-Ice-Maker-Replacement.jpg",
    "manufacturerPartNumber": "WPW10300022",
    "partType": "ice maker",
    "appliance": "refrigerator",
    "partUrl": "https://www.partselect.com/PS11752389-Whirlpool-WPW10300022-Refrigerator-Ice-Maker-Replacement.htm?SourceCode=18",
    "starRating": "95%",
    "description": "The replacement ice maker does not include a new ice level arm, or wire harness, these components will need to be reused from original ice maker.",
    "numberOfReviews": 26
  },
  "PS10065979": {
    "partNumber": "PS10065979",
    "name": "Dishwasher Upper Rack Adjuster Kit - White Wheels, Left and Right Sides",
    "price": "$39.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/10065979-1-N-Whirlpool-W10712395-Upper-Rack-Adjuster-Kit-White-Wheels-Left-and-Right-Sides.jpg",
    "manufacturerPartNumber": "W10712395",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS10065979-Whirlpool-W10712395-Upper-Rack-Adjuster-Kit-White-Wheels-Left-and-Right-Sides.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This authentic Dishwasher Upper Rack Adjuster Kit with white wheels is a kit made up of primarily plastic and metal components, which will require a screwdriver to install. This kit comes with all the necessary parts for a dishwasher rack adjuster. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. If broken then the rack will no longer slide properly, and the part must be replaced. In many cases, our customers have reported the top rack of their dishwasher hanging down or sagging due to the adjuster kit, particularly if the wheels, have broken or failed. If you are having problems in this area, this kit will help get your dishwasher back up and running. Check your model number and user manual to see if this part is right for you. The parts for this kit come as a package and are not generally sold individually.",
    "numberOfReviews": 629
  },
  "PS11746591": {
    "partNumber": "PS11746591",
    "name": "Dishwasher Rack Track Stop",
    "price": "$7.70",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11746591-1-N-Whirlpool-WP8565925-Rack-Track-Stop.jpg",
    "manufacturerPartNumber": "WP8565925",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS11746591-Whirlpool-WP8565925-Rack-Track-Stop.htm?SourceCode=18",
    "starRating": "92%",
    "description": "The rack track stop on your dishwasher is designed to stop the dish rack at the appropriate place when opening and closing the rack. If your dishwasher is not cleaning your dishes properly, the rack stop may need to be replaced. The replacement part may differ slightly from the broken part, depending on the model. However, the different styles are interchangeable. This product is sold individually and comes in both a white and grey plastic version. Many of our customers found this repair to be very easy and takes less than 30 minutes to complete. Simply snap the old part out and snap the new part into place. You will not require any tools to complete the job. This is an authentic part approved by the manufacturer.",
    "numberOfReviews": 121
  },
  "PS3406971": {
    "partNumber": "PS3406971",
    "name": "Dishwasher Lower Dishrack Wheel",
    "price": "$26.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/3406971-1-N-Whirlpool-W10195416-Lower-Dishrack-Wheel.jpg",
    "manufacturerPartNumber": "W10195416",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS3406971-Whirlpool-W10195416-Lower-Dishrack-Wheel.htm?SourceCode=18",
    "starRating": "97%",
    "description": "This OEM gray Dishwasher Lower Dishrack Wheel Assembly is a plastic kit that allows the rack to slide in and out of the dishwasher easily. If it breaks or becomes damaged. sliding will feel difficult. This can happen due to normal wear and tear, and the part should be replaced if this occurs. Check your model number and user manual to make sure this part is correct. It attaches directly to the dishrack. To repair, open the dishwasher door and pull out the lower dishrack. Next, push the tab from both sides and it should pop out. To install the new wheel assembly, place it on the rack and make sure the caps overlap the wire from the inside before you clip it in place by pushing the wheel. It measures roughly 3x6 inches.",
    "numberOfReviews": 337
  },
  "PS17137081": {
    "partNumber": "PS17137081",
    "name": "Dishwasher LOWER SPRAY ARM",
    "price": "$19.70",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/17137081-1-N-GE-WD22X33499-LOWER-SPRAY-ARM.jpg",
    "manufacturerPartNumber": "WD22X33499",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS17137081-GE-WD22X33499-LOWER-SPRAY-ARM.htm?SourceCode=18",
    "starRating": "97%",
    "description": "This lower spray arm assembly in your dishwasher distributes water and detergent during the washing cycle by spinning around and spraying water in different directions. You can usually find it attached to a support or hub at the bottom of the dishwasher. If this part is broken, you might notice some signs. You might hear a knocking or banging sound coming from the dishwasher. The spray arm may not rotate properly or might seem wobbly. It is important to replace a damaged arm assembly as your dishes will not get cleaned properly, and they will still have dirt on them even after a wash cycle. It can also cause the dishwasher to have a bad smell because of leftover food residue. To remove your existing arm assembly, you will need to release its locking mechanism before lifting it out of your appliance. Please be informed that this OEM-verified part is sold individually.",
    "numberOfReviews": 31
  },
  "PS12585623": {
    "partNumber": "PS12585623",
    "name": "Dishwasher Lower Spray Arm",
    "price": "$31.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/12585623-1-N-Frigidaire-5304517203-Lower-Spray-Arm.jpg",
    "manufacturerPartNumber": "5304517203",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS12585623-Frigidaire-5304517203-Lower-Spray-Arm.htm?SourceCode=18",
    "starRating": "95%",
    "description": "The Lower Spray Arm is used in your dishwasher to spray water and clean your dishes. If broken there will be visible damage or your dishes may no longer be cleaned properly. If your spray arm is broken (due to general wear or high heat), it should be replaced. Your lower spray arm will be located at the bottom of your dishwasher tub. Check your user manual and model number to ensure this model is right for you. This version is plastic and metal and comes in gray/blue. We recommend you wear work gloves to keep your hands safe when installing and disconnect power to the appliance. You will also want to make sure that you turn off the water supply to your dishwasher. From here, you will want to open the dishwasher, pull out the lower rack and set it aside. Remove the lower wash arm. On each side of the bottom of the spray arm, there are small locking tabs that can be pushed aside using a flathead screwdriver. Once released, the spray arm can easily be pulled off the dishwasher. Put the new lower wash arm in place and push it down to lock it in. Ensure it is spinning freely and does not hit the heating element. Return the lower dish rack into place and then close the dishwasher door.",
    "numberOfReviews": 125
  },
  "PS11750057": {
    "partNumber": "PS11750057",
    "name": "Dishwasher Lower Dishrack Wheel Assembly",
    "price": "$33.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11750057-1-N-Whirlpool-WPW10195417-Lower-Dishrack-Wheel-Assembly.jpg",
    "manufacturerPartNumber": "WPW10195417",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS11750057-Whirlpool-WPW10195417-Lower-Dishrack-Wheel-Assembly.htm?SourceCode=18",
    "starRating": "94%",
    "description": "This gray plastic lower dishrack roller is a part for your dishwasher. It attaches to the bottom of the lower dishrack, allowing it to move in and out smoothly. If the lower dishrack stops moving in and out easily or preventing you from being able to shut the dishwasher door, inspect the dishrack roller for damage. The assembly includes 2 rollers and the bracket that attaches to the dishrack (parts are not sold separately). This assembly is sold individually, so you will need 4 assemblies to replace them all in your appliance. For this easy repair, start by removing the lower dishrack from the appliance and set it on the counter. Use a screwdriver to pry off the old roller assembly from the lower tabs. Align the new part on the dishrack by snapping it in place.",
    "numberOfReviews": 112
  },
  "PS11756150": {
    "partNumber": "PS11756150",
    "name": "Dishwasher Upper Rack Adjuster",
    "price": "$24.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11756150-1-N-Whirlpool-WPW10546503-Dishwasher-Upper-Rack-Adjuster.jpg",
    "manufacturerPartNumber": "WPW10546503",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS11756150-Whirlpool-WPW10546503-Dishwasher-Upper-Rack-Adjuster.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This OEM Dishwasher Upper Rack Adjuster is a grayish-black, plastic part which will require a screwdriver to install. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. If broken then the rack will no longer slide properly, and the part must be replaced. The installation has been rated as \"easy\" by customers. Before beginning any repair, you should unplug the dishwasher and wear gloves to protect your hands. Check your model number and user manual to see if this part is right for you! Your dishwasher should have a left and right upper rack adjuster, and both are the same part. These parts are sold individually, so if you are looking to replace both, you will need to order two parts.",
    "numberOfReviews": 123
  },
  "PS16217024": {
    "partNumber": "PS16217024",
    "name": "Dishwasher LOWER RACK ROLLER",
    "price": "$13.11",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/16217024-1-N-GE-WD12X26146-LOWER-RACK-ROLLER.jpg",
    "manufacturerPartNumber": "WD12X26146",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS16217024-GE-WD12X26146-LOWER-RACK-ROLLER.htm?SourceCode=18",
    "starRating": "94%",
    "description": "The lower rack roller supports the smooth sliding of your dishwasher’s bottom rack. Measuring 1.5 inches in diameter and charcoal-colored, this OEM replacement part is sold individually. Replace all four rollers at once for consistent performance. Wear gloves during installation.",
    "numberOfReviews": 20
  },
  "PS9495545": {
    "partNumber": "PS9495545",
    "name": "Dishwasher Bottom Door Gasket",
    "price": "$21.06",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/9495545-1-N-Frigidaire-809006501-Dishwasher-Bottom-Door-Gasket.jpg",
    "manufacturerPartNumber": "809006501",
    "partType": "gasket",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS9495545-Frigidaire-809006501-Dishwasher-Bottom-Door-Gasket.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This dishwasher door gasket (Bottom Gasket, Gasket, Door Seal, Dishwasher Door Lower Seal) helps prevent water from leaking out of the bottom edge of your dishwasher door by creating a watertight seal. This part is attached to the bottom of your dishwasher inner door panel. It is frequently exposed to water and detergent during its lifetime. The water and chemicals can eventually wear down the gasket and compromise the integrity of the seal. If the gasket is malfunctioning, the integrity of the door seal will be effected. You will notice leaking through the bottom of your dishwasher door. If your dishwasher is leaking water from the bottom of the door, first inspect the seal for food particles near the bottom and sides, and remove the buildup, as it can stop the door from closing properly and keeping a tight seal; if not, you may need to replace the bottom door gasket. Check the door gasket for tears, cuts, or wear. This part is sold individually and measures 22.5 inches by 1.25 inches. It is constructed of plastic, and comes in yellow/grey. Includes one lower door gasket.",
    "numberOfReviews": 184
  },
  "PS8727387": {
    "partNumber": "PS8727387",
    "name": "Dishwasher Dishrack Roller - Grey",
    "price": "$11.11",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/8727387-1-N-Bosch-00611475-Dishrack-Roller-Grey.jpg",
    "manufacturerPartNumber": "00611475",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS8727387-Bosch-00611475-Dishrack-Roller-Grey.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This is a replacement dishrack roller or wheel for your dishwasher. It is made of gray plastic, measures a little over an inch in diameter, and is sold individually. This roller is designed for the lower dishrack of your dishwasher. On one side of the roller is a clip that allows it to be attached to the dishrack. The dishrack roller allows you to slide the dishrack in and out of the dishwasher efficiently. If one of the rollers is broken or missing, it can cause the dishrack to become difficult to slide in and out. To replace the roller, simply snap it off the dishrack, and snap the new one into place. This is a genuine OEM part.",
    "numberOfReviews": 26
  },
  "PS12586284": {
    "partNumber": "PS12586284",
    "name": "Freezer Air Filter",
    "price": "$20.30",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/12586284-1-N-Frigidaire-PAULTRA2-Air-Filter.jpg",
    "manufacturerPartNumber": "PAULTRA2",
    "partType": "filter",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS12586284-Frigidaire-PAULTRA2-Air-Filter.htm?SourceCode=18",
    "starRating": "97%",
    "description": "This package contains one carbon activated filter for refrigerators with Pure Air Ultra II filtration systems. The air filter cleans the air and absorbs strong odors from fragrant foods, such as onions, garlic, seafood, and over-ripe fruits and vegetables. By absorbing these unpleasant smells, it will also improve the flavor of your ice cubes. This is a simple repair that does not require tools for installation or removal. Start by removing the plastic wrap on the new filter, remove the cover from the housing inside the refrigerator, remove the old filter, place the new filter into the housing, and close the cover. Depending on the model of your appliance, you may need to reset the filter reminder. This part is OEM official, guaranteeing a smooth install and proper fit.",
    "numberOfReviews": 13
  },
  "PS12724833": {
    "partNumber": "PS12724833",
    "name": "Freezer Refrigerator Water Filter",
    "price": "$80.19",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/12724833-1-N-LG-AGF80300702-Refrigerator-Water-Filter.jpg",
    "manufacturerPartNumber": "AGF80300702",
    "partType": "filter",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS12724833-LG-AGF80300702-Refrigerator-Water-Filter.htm?SourceCode=18",
    "starRating": "99%",
    "description": "This refrigerator water filter replacement is for 2010 LG refrigerators that have either forward French doors or are the four-door dispensing models. This filter is designed to minimize impurities that can cause ill-tasting water or an unpleasant smell. It reduces sediment, dirt, rust, limescale, sand, and many other contaminants that can be harmful to your health and the life of your appliance. This filter should be replaced every 6 months or 200 gallons to ensure top quality performance. To remove your unwanted filter, press the push button to open the filter cover (water may spill from the hole), pull out the old cartridge in a downward motion. To install the new filter, make it so the ears are in the horizontal position and push the new cartridge into the housing until it stops. Push the filter upward until it is secure. Click the cover to lock it in place. Run water for approximately 5 minutes to prep the filter for use, and discard water. Reset the “filter reset” button if applicable.",
    "numberOfReviews": 18
  },
  "PS3532772": {
    "partNumber": "PS3532772",
    "name": "Freezer Roller Assembly",
    "price": "$11.47",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/3532772-1-N-LG-AHJ72909001-Roller-Assembly.jpg",
    "manufacturerPartNumber": "AHJ72909001",
    "partType": "unknown",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS3532772-LG-AHJ72909001-Roller-Assembly.htm?SourceCode=18",
    "starRating": "89%",
    "description": "This is a drawer roller for the freezer compartment of your LG refrigerator. This roller is made of white plastic, and acts as a wheel to allow the drawer to glide smoothly back and forth when you open and close the freezer compartment. Over time and with further frequent use, this roller can crack, break, or stop rolling smoothly, at which point it will need replacing. Your refrigerator comes with two rollers, and this roller is sold individually, so consider how many rollers you require before ordering.",
    "numberOfReviews": 11
  },
  "PS2350702": {
    "partNumber": "PS2350702",
    "name": "Freezer Defrost Thermostat",
    "price": "$23.12",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/2350702-1-N-Frigidaire-297216600-Defrost-Thermostat.jpg",
    "manufacturerPartNumber": "297216600",
    "partType": "unknown",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS2350702-Frigidaire-297216600-Defrost-Thermostat.htm?SourceCode=18",
    "starRating": "95%",
    "description": "This refrigerator defrost thermostat is a genuine OEM part and is sourced directly from the manufacturer. Located on the back wall of the freezer section in the refrigerator, the defrost thermostat is used to regulate the appliances temperature to keep the refrigerator cold and constant. The part is made of plastic, and has a 4 inch terminal on the white lead and a 6 inch terminal on the red lead. A refrigerator defrost thermostat may need to be replaced if the appliance is experiencing temperature related issues such as: too cold, too warm, frost buildup, not running, or running too long.",
    "numberOfReviews": 33
  },
  "PS1991481": {
    "partNumber": "PS1991481",
    "name": "Freezer Door Key",
    "price": "$11.22",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/1991481-1-N-Frigidaire-297147700-Freezer-Door-Key.jpg",
    "manufacturerPartNumber": "297147700",
    "partType": "unknown",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS1991481-Frigidaire-297147700-Freezer-Door-Key.htm?SourceCode=18",
    "starRating": "89%",
    "description": "This freezer door key is designed for use with most upright and chest freezers. It is an authentic OEM replacement part. Your appliance has a lid or door that locks and unlocks, this key controls that function. If your key is lost or damaged this is the replacement you need. Be sure to store this key someplace safe, we also recommend that you store it away from the freezer. This part is made of plastic, is white in color, and it is sold individually.",
    "numberOfReviews": 23
  },
  "PS12374439": {
    "partNumber": "PS12374439",
    "name": "Freezer PLATE ASSEMBLY,FRONT",
    "price": "$145.29",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/12374439-1-N-LG-AGU75188619-PLATE-ASSEMBLY-FRONT.jpg",
    "manufacturerPartNumber": "AGU75188619",
    "partType": "unknown",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS12374439-LG-AGU75188619-PLATE-ASSEMBLY-FRONT.htm?SourceCode=18",
    "starRating": "94%",
    "description": "This is a replacement mullion rail for your French door-style refrigerator. You will typically find the mullion rail on the left side refrigerator door. The mullion rail helps to keep the refrigerator door closed. If the door will not close properly or if you notice leaking on your floor, you may need to replace the door mullion. A faulty mullion can gather moisture, resulting in a leak. To replace the mullion, simply disconnect the old mullion from the wire harness and unscrew it. Re-attach the wire harness to the mullion and screw it back into place.",
    "numberOfReviews": 72
  },
  "PS3523083": {
    "partNumber": "PS3523083",
    "name": "Freezer Door Stopper",
    "price": "$13.55",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/3523083-1-N-LG-4620JJ2009A-Door-Stopper.jpg",
    "manufacturerPartNumber": "4620JJ2009A",
    "partType": "unknown",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS3523083-LG-4620JJ2009A-Door-Stopper.htm?SourceCode=18",
    "starRating": "84%",
    "description": "The door stop, or door stopper, is used in refrigerators. This door stop helps keep the door in position and in balance. This part is attached to the bottom of the door and it keeps it from opening and hitting the side of the refrigerator cabinet. If you find your door hits and scratches your lower cabinet when you open your fridge door, installing this part can be a solution to this problem. Make sure to unplug your appliance from the power source before installing this part and safely store food to prevent it from deteriorating. Refer to the diagram provided by the manufacturer for further instruction.",
    "numberOfReviews": 5
  },
  "PS11770643": {
    "partNumber": "PS11770643",
    "name": "Freezer Door Gasket",
    "price": "$125.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11770643-1-N-Frigidaire-5304507199-Freezer-Door-Gasket.jpg",
    "manufacturerPartNumber": "5304507199",
    "partType": "gasket",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS11770643-Frigidaire-5304507199-Freezer-Door-Gasket.htm?SourceCode=18",
    "starRating": "76%",
    "description": "This gasket is used to seal the freezer door when closed to keep the cool air inside and the warm temperature surrounding the freezer from getting in. It is white in color. If you notice that your freezer is not shutting with ease, is not maintaining your desired temperature, or there is frost build up, it could be due to the door gasket being damaged. You might also notice that there is a leak coming from the door and this could also be caused by the gasket being worn, damaged, or no longer aligned properly. You will need to remove the existing screws before installing the gasket.",
    "numberOfReviews": 29
  },
  "PS12585793": {
    "partNumber": "PS12585793",
    "name": "Freezer DEFROST TIMER",
    "price": "$28.03",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/12585793-1-N-Frigidaire-5304518034-DEFROST-TIMER.jpg",
    "manufacturerPartNumber": "5304518034",
    "partType": "unknown",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS12585793-Frigidaire-5304518034-DEFROST-TIMER.htm?SourceCode=18",
    "starRating": "92%",
    "description": "This is a 120 volt defrost timer manufactured for refrigerators. The defrost timer manages the automatic defrost systemin the unit. It acts like a clock by switching between activating the cooling cycle and the defrost heater to maintain the set thermostat temperature, preventing the unit from being too warm or cold. The defrost timer may need to be replaced if the fridge will not maintain its temperature or has frost buildup. Depending on the model, it could be located on the rear panel or ceiling of the fresh food compartment. Be sure to disconnect power to the refrigerator before replacing this part.",
    "numberOfReviews": 14
  },
  "PS3495561": {
    "partNumber": "PS3495561",
    "name": "Freezer Run Capacitor - 120V",
    "price": "$38.37",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/3495561-1-N-Frigidaire-297286803-Run-Capacitor-120V.jpg",
    "manufacturerPartNumber": "297286803",
    "partType": "unknown",
    "appliance": "freezer",
    "partUrl": "https://www.partselect.com/PS3495561-Frigidaire-297286803-Run-Capacitor-120V.htm?SourceCode=18",
    "starRating": "89%",
    "description": "This part helps the compressor kick on and off while maintaining a constant temperature to keep things frozen in your freezer. The run capacitor is attached to the compressor. This part is 120 volts and 15 mfd. The run capacitor helps the compressor kick on and off while maintaining a constant temperature to keep things frozen in your freezer. If your refrigerator is too warm, will not start, or your freezer section is too warm, you may need to replace this part. This is a genuine OEM part. Please remember to disconnect power to your refrigerator before starting your repair.",
    "numberOfReviews": 16
  },
  "PS16744934": {
    "partNumber": "PS16744934",
    "name": "Dishwasher Circulation Pump",
    "price": "$69.99",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/16744934-1-N-Whirlpool-W11612326-Circulation-Pump.jpg",
    "manufacturerPartNumber": "W11612326",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS16744934-Whirlpool-W11612326-Circulation-Pump.htm?SourceCode=18",
    "starRating": "97%",
    "description": "This circulation pump is a genuine OEM replacement part designed for use in dishwashers. It is responsible for circulating water throughout the dishwasher during the wash and rinse cycles. The circulation pump draws water from the dishwasher tub, pressurizes it, and then distributes it to the spray arms, which spray the water onto the dishes to remove food particles and debris. The circulation pump may fail due to several reasons such as an electrical fault, a blockage in the pump impeller, motor failure, or physical damage. A faulty pump will result in water leakages, unusually loud noises during use, reduced water circulation, and poor cleaning performance.",
    "numberOfReviews": 6
  },
  "PS8689824": {
    "partNumber": "PS8689824",
    "name": "Dishwasher Drain Pump -120V 60Hz",
    "price": "$100.36",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/8689824-1-N-Frigidaire-A00126401-Drain-Pump-120V-60Hz.jpg",
    "manufacturerPartNumber": "A00126401",
    "partType": "drain pump",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS8689824-Frigidaire-A00126401-Drain-Pump-120V-60Hz.htm?SourceCode=18",
    "starRating": "98%",
    "description": "This is a drain pump assembly for various compatible models of dishwashers, that is responsible for draining the water from the dishwasher after every cycle. This drain pump assembly is made of plastic and fits within the sump assembly, which controls the flow of water into the drain. This drain pump assembly is a genuine OEM part and is made of a high-quality plastic but is sold as an individual component without any other parts, like its drain pump check ball which works within the pump to prevent water from backwashing into the pump, as well as the drain pump cover. If you notice your dishwasher is not draining or has a lot of water buildup at the bottom of the sump assembly, this filter may be damaged, clogged or broken, and in need of a replacement. To replace this pump assembly, you will only need a Philips-head screwdriver, but should start by removing your dishwasher racks. Then, pull up on the lower spray arm, and drain trap to remove them. Next, rotate the spray arm support and pull that up to remove it, at which point you can remove the base and filter for the drain pump. With those out, you can use your Philips-head screwdriver to disconnect and remove the cover and drain pump assembly. With the pump removed, you can inspect it or install the new drain pump assembly, with the same hardware as before. Then it is as simple as reassembling the rest of your dishwasher, ensuring each connection point is fastened tightly.",
    "numberOfReviews": 16
  },
  "PS11753379": {
    "partNumber": "PS11753379",
    "name": "Dishwasher Drain Pump",
    "price": "$64.05",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11753379-1-N-Whirlpool-WPW10348269-Dishwasher-Drain-Pump.jpg",
    "manufacturerPartNumber": "WPW10348269",
    "partType": "drain pump",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS11753379-Whirlpool-WPW10348269-Dishwasher-Drain-Pump.htm?SourceCode=18",
    "starRating": "97%",
    "description": "This drain pump is used in dishwashers to remove water from the dishwasher tub. If the impeller in the dishwasher is damaged or the motor has been shorted out and will not drain, it is possible the body is cracked, causing leakage. To prevent this from happening, replace the drain pump. The tools needed for this installation are: Phillips screwdriver, 5/16 inch nut driver, 5/8 inch wrench, and a flathead screwdriver. Remember to unplug your dishwasher from the power source before beginning this installation project. Refer to the manual provided by the manufacturer for further installation instructions.",
    "numberOfReviews": 57
  },
  "PS12582714": {
    "partNumber": "PS12582714",
    "name": "Dishwasher Drain Pump Kit",
    "price": "$51.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/12582714-1-N-GE-WD19X24829-Drain-Pump-Kit.jpg",
    "manufacturerPartNumber": "WD19X24829",
    "partType": "drain pump",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS12582714-GE-WD19X24829-Drain-Pump-Kit.htm?SourceCode=18",
    "starRating": "96%",
    "description": "This is a drain pump kit for dishwashers. The drain pump for is responsible for pulling out and removing all contaminated food water from your dishwasher during and at the end of its washing cycle. If you notice water standing in your dishwasher after the cycle is over, or if you experience and notice leaks underneath your dishwasher, the pump will likely need to be replaced. This drain pump kit comes with the drain itself, as well as 5 different metal screw clamps of varying sizes. Replacing this drain pump will require some disassembly of your dishwasher, which means you will need a screwdriver, wrench, and protective equipment such as work gloves. This drain pump is sold as an individual OEM part, and does not come with any hoses or wire harnesses, so consider that before ordering.",
    "numberOfReviews": 23
  },
  "PS16219695": {
    "partNumber": "PS16219695",
    "name": "Dishwasher Single Speed Drain Pump Kit",
    "price": "$113.63",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/16219695-1-N-GE-WD19X25187-Single-Speed-Drain-Pump-Kit.jpg",
    "manufacturerPartNumber": "WD19X25187",
    "partType": "drain pump",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS16219695-GE-WD19X25187-Single-Speed-Drain-Pump-Kit.htm?SourceCode=18",
    "starRating": "91%",
    "description": "This drain pump kit is for dishwashers. The drain pump kit removes the water from the dishwasher tub during the drain phase of the dishwashing cycle. The kit may include multiple parts; refer to your parts diagram for a complete list of parts included. Unplug the dishwasher and shut off the water supply before installing this part. Wear work gloves to protect your hands.",
    "numberOfReviews": 30
  },
  "PS1734917": {
    "partNumber": "PS1734917",
    "name": "Dishwasher Chopper Assembly",
    "price": "$34.74",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/1734917-1-N-Whirlpool-W10083957-Chopper-Assembly.jpg",
    "manufacturerPartNumber": "W10083957",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS1734917-Whirlpool-W10083957-Chopper-Assembly.htm?SourceCode=18",
    "starRating": "94%",
    "description": "This is a chopper assembly or drain food chopper, and it is designed for your dishwasher. The chopper chops up/minces the food particles in your dishwasher to prevent them from clogging the pump. You may need to replace this part if your dishes are not being cleaned properly, your appliance is particularly noisy, or you are noticing draining problems. The tools you will need to make this repair include a number 20 and a number 15 torque screwdriver, a small flat blade screwdriver, and a pair of needle nose pliers.",
    "numberOfReviews": 46
  },
  "PS11724988": {
    "partNumber": "PS11724988",
    "name": "Dishwasher Circulation Pump with Heater",
    "price": "$112.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11724988-1-N-Bosch-12008381-Dishwasher-Circulation-Pump-with-Heater.jpg",
    "manufacturerPartNumber": "12008381",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS11724988-Bosch-12008381-Dishwasher-Circulation-Pump-with-Heater.htm?SourceCode=18",
    "starRating": "100%",
    "description": "This circulation pump with heater is for dishwashers. Circulation pump with heater moves heated water through the spray arm to clean the dishes. Unplug the dishwasher before installing this part. Wear work gloves to protect your hands.",
    "numberOfReviews": 5
  },
  "PS11704799": {
    "partNumber": "PS11704799",
    "name": "Dishwasher PUMP-DRAIN",
    "price": "$36.74",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11704799-1-N-Bosch-00631200-PUMP-DRAIN.jpg",
    "manufacturerPartNumber": "00631200",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS11704799-Bosch-00631200-PUMP-DRAIN.htm?SourceCode=18",
    "starRating": "100%",
    "description": "This drain pump is a genuine OEM replacement part that is specially made for various models of dishwasher. It is responsible for removing water from the dishwasher at the end of a cycle. It pumps the water out through the drain hose, which is connected to the kitchen sink plumbing or a dedicated drain line. If you notice an unpleasant odor and water pooling at the bottom of your dishwasher after a cycle, it could indicate a problem with the drain pump. If the pump is faulty you may also hear unusual rattling and grinding sounds.",
    "numberOfReviews": 3
  },
  "PS11738151": {
    "partNumber": "PS11738151",
    "name": "Dishwasher Drain Pump",
    "price": "$58.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11738151-1-N-Whirlpool-W10876537-Dishwasher-Drain-Pump.jpg",
    "manufacturerPartNumber": "W10876537",
    "partType": "drain pump",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS11738151-Whirlpool-W10876537-Dishwasher-Drain-Pump.htm?SourceCode=18",
    "starRating": "93%",
    "description": "This drain pump is for dishwashers. Drain pump removes the water from the dishwasher tub during the drain phase of the dishwashing cycle. Unplug the dishwasher and shut off the water supply before installing this part. Wear work gloves to protect your hands.",
    "numberOfReviews": 14
  },
  "PS11772000": {
    "partNumber": "PS11772000",
    "name": "Dishwasher Circulation Pump",
    "price": "$103.89",
    "image": "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/11772000-1-N-GE-WD26X23258-Circulation-Pump.jpg",
    "manufacturerPartNumber": "WD26X23258",
    "partType": "unknown",
    "appliance": "dishwasher",
    "partUrl": "https://www.partselect.com/PS11772000-GE-WD26X23258-Circulation-Pump.htm?SourceCode=18",
    "starRating": "94%",
    "description": "The Circulation Pump is an OEM part for some GE dishwashers. It is responsible for circulating water throughout the dishwasher. Be sure to use the model number of the appliance to confirm compatibility.",
    "numberOfReviews": 15
  },
  "Support Phone Number": "1-866-319-8402"
}